Revit 2024 API
PanelTypeSet.Insert Method
Insert the specified panel type into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Insert(
	PanelType item
)
Visual Basic
Public Overridable Function Insert ( _
	item As PanelType _
) As Boolean
Visual C++
public:
virtual bool Insert(
	PanelType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.PanelType
The panel type to be inserted into the set.
Return Value
Returns whether the panel type was inserted into the set.
See Also
PanelTypeSet Class
Autodesk.Revit.DB Namespace